cases/cavity_3D_8M_fixedIter/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allpre
runParallel $(getApplication)

#------------------------------------------------------------------------------
